/*
Java: знакомство и как пользоваться базовым API (семинары)
Урок 1. Знакомство с языком программирования Java
https://gb.ru/lessons/414471


// 00:17:00

IntelliJ IDEA от JetBrains - среда разработки Java (для джавистов).
VSCode для остальных достаточно и пакет расширений Extension Pack for Java.

В Java не принято использовать нижнее подчёркивание, в отличие от Python. 
Поэтому, название файла должно соответствовать следующей форме 
<NameName.java>, с загалавных букв без нижних подчёркиваний. 

VSCode работает криво, если название корневой папки (java_project),
с нижним подчёркиванием и с маленькой буквы, 
как и название название файла (program.java), так показано в лекции.
У преподавателя операционнная система MacOS, видимо, 
на ней подобная форма записи имён файлов и папок допустимы, либо 
сделаны дополнительные настройки в среде разработки VSCode.

Переписал названия папок и файлов, с заглавной буквы 
и без нижних подчёркиваний между словами. Всё заработало, как надо.

 */


package JavaSeminar.Seminar01;

public class S01PointEntry {
    
}
