/*
Урок 4. Хранение и обработка данных ч1: приоритетные коллекции
https://gb.ru/lessons/414474


01:37:10

Задание №3

1) Написать метод, который принимает массив элементов, 
   помещает их в стэк и выводит на консоль содержимое стэка.
2) Написать метод, который принимает массив элементов, 
   помещает их в очередь и выводит на консоль содержимое очереди. 

 */
package JavaSeminar.Seminar04;
/*
 * 1) Написать метод, который принимает массив элементов, 
 *    помещает их в стэк и выводит на консоль содержимое стэка.
 * 2) Написать метод, который принимает массив элементов, 
 *    помещает их в очередь и выводит на консоль содержимое очереди. 
 */
public class S03StackQueue {
    
}
