/*
Урок 6. Хранение и обработка данных ч3: множество коллекций Set
https://gb.ru/lessons/414476


00:35:30

Задание №1

1. Напишите метод, который заполнит массив 
из 1000 элементов случайными цифрами от 0 до 500.

2. Создайте метод, в который передайте заполненный выше массив, 
с помощью Set вычислите процент уникальных значений в данном массиве 
и верните его в виде числа с плавающей запятой.

Для вычисления процента используйте формулу:
процент уникальных чисел = количество уникальных чисел * 100 / общее количество чисел в массиве.


Решение
()
*/

