/*
Урок 6. Хранение и обработка данных ч3: множество коллекций Set
https://gb.ru/lessons/414476


01:36:00

Задание №2
(Андрей Лопатько)
 */
package JavaSeminar.Seminar06;

/**
1. Продумайте структуру класса Кот. 
Какие поля и методы будут актуальны для приложения, которое является
    а) информационной системой ветеринарной клиники
    б) архивом выставки котов
    в) информационной системой Театра кошек Ю. Д. Куклачёва
Можно записать в текстовом виде, не обязательно реализовывать в java.
 */
public class S03ClassStructure {
    
}
